Autodesk.Revit.DB.Visual.Speckle.TextureAngle
The property labeled "Angle" from the "Speckle" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray3d".
Since:
2018.1

Autodesk.Revit.DB.Visual.Speckle.TextureRealWorldOffsetZ
The property labeled "Offset Z" from the "Speckle" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.Speckle.TextureRealWorldOffsetY
The property labeled "Offset Y" from the "Speckle" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.Speckle.TextureRealWorldOffsetX
The property labeled "Offset X" from the "Speckle" schema.
Remarks:
This property is of type "AssetPropertyDistance".
Since:
2018.1

Autodesk.Revit.DB.Visual.Speckle.TextureLinkTextureTransforms
The property labeled "Link Transforms" from the "Speckle" schema.
Remarks:
This property is of type "AssetPropertyBoolean".
Since:
2018.1

Autodesk.Revit.DB.Visual.Speckle.SpeckleSize
The property labeled "Size" from the "Speckle" schema.
Remarks:
This property is of type "AssetPropertyDouble" within the range of "0, 100".
Since:
2018.1

Autodesk.Revit.DB.Visual.Speckle.SpeckleColor2
The property labeled "Color 2" from the "Speckle" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.Speckle.SpeckleColor1
The property labeled "Color 1" from the "Speckle" schema.
Remarks:
This property is of type "AssetPropertyDoubleArray4d".
This property allows a connected asset.
Since:
2018.1

Autodesk.Revit.DB.Visual.Speckle
Represents the properties of materials.
Since:
2018.1